CSI API ETABS v1

# cGridSysGetGridSysType Method

---

**Namespace:** ETABSv1
**Assembly:** ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (1.27.0.0)

Syntax

C#

VB

C++

F#

Copy

    int GetGridSysType(
    	string Name,
    	ref string GridSysType
    )

    Function GetGridSysType (
    	Name As String,
    	ByRef GridSysType As String
    ) As Integer

    Dim instance As cGridSys
    Dim Name As String
    Dim GridSysType As String
    Dim returnValue As Integer

    returnValue = instance.GetGridSysType(Name,
    	GridSysType)

    int GetGridSysType(
    	String^ Name,
    	String^% GridSysType
    )

    abstract GetGridSysType :
            Name : string *
            GridSysType : string byref -> int

#### Parameters

Name

    Type: SystemString

GridSysType

    Type: SystemString

#### Return Value

Type: Int32

See Also

#### Reference

cGridSys Interface

ETABSv1 Namespace

ETABS®, SAFE®, SAP2000® and CSiBridge® are registered trademarks of Computers
and Structures, Inc.

Copyright © Computers and Structures, Inc. 2023. All rights
reserved.

support@csiamerica.com